sabil62/Floatsat/codes/obc/dependencies/rodos/support/support-programs/middleware-standalone/src/stm32f4/hal/hal_uart.cpp
/*
 * Copyright (c) 2011 Uni Wuerzburg, Wuerzburg

 * All rights reserved.
 *
 * @author Michael Ruffer
 */

/* By driver enabled pins, "()"->also possible
 * - pins can be changed in HAL_UART::HAL_UART()
   UART1 - Rx:  PB7  (PA10)             Tx: PB6     (PA9)
           RTS: PA12                    CTS:PA11

   UART2 - Rx:  PD6  (PA3)              Tx: PD5     (PA2)
           RTS: PD4  (PA1)              CTS:PD3     (PA0)

   UART3 - Rx:  PD9  (PB11, PC11)       Tx: PD8     (PB10 , PC10)
           RTS: PB14 (PD12)             CTS:PD11    (PB13)

   UART4 - Rx:  PC11 (PA1)              Tx:PC10     (PA0)
           // no hardware flow control

   UART5 - Rx:  PD2                     Tx: PC12
           // no hardware flow control

   UART6 - Rx:  PC7                     Tx: PC6
           RTS: PG8 (PG12)              CTS: PG15 (PG13)

   // STM32F42x/STM32F43x only
   UART7 - Rx:  PF6 (PE7)               Tx: PF7 (PE8)
           // no hardware flow control

   UART8 - Rx:  PE0                     Tx: PE1
           // no hardware flow control
*/

//#include "rodos.h"
#include "fifo.h"
#include "hal/hal_uart.h"
#include "hw_hal_gpio.h"


#include "../STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_rcc.h"
#include "../STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_gpio.h"
#include "../STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_usart.h"
#include "../STM32F4xx_StdPeriph_Driver/inc/stm32f4xx_dma.h"


#define UART_IDX_MIN        UART_IDX1
#if defined (STM32F427_437xx) || defined (STM32F429_439xx)
#define UART_IDX_MAX        UART_IDX8
#else
#define UART_IDX_MAX        UART_IDX6
#endif

#define UART_IDX_MAX_DMA    UART_IDX3


#ifndef NO_RODOS_NAMESPACE
namespace RODOS {
#endif

extern "C"{
	void USART1_IRQHandler();
	void USART2_IRQHandler();
	void USART3_IRQHandler();
	void UART4_IRQHandler();
	void UART5_IRQHandler();
	void USART6_IRQHandler();
	void UART7_IRQHandler();
	void UART8_IRQHandler();

	void DMA2_Stream7_IRQHandler();
	void DMA1_Stream6_IRQHandler();
	void DMA1_Stream3_IRQHandler();

	void DMA2_Stream5_IRQHandler();
	void DMA1_Stream5_IRQHandler();
	void DMA1_Stream1_IRQHandler();

}

#define DMA_TIMEOUT 10*MILLISECONDS

void EnableDMAClock();

/*
class ReceiveTrigger : Thread {
public:
	ReceiveTrigger():Thread("UARTRecvTrigger"){}
private:
	void run();
};
*/

class HW_HAL_UART {

	friend class ReceiveTrigger;
	friend class HAL_UART;

	friend void USART1_IRQHandler();
	friend void USART2_IRQHandler();
	friend void USART3_IRQHandler();
	friend void UART4_IRQHandler();
	friend void UART5_IRQHandler();
	friend void USART6_IRQHandler();
	friend void UART7_IRQHandler();
	friend void UART8_IRQHandler();


	friend void DMA2_Stream7_IRQHandler();
	friend void DMA1_Stream6_IRQHandler();
	friend void DMA1_Stream3_IRQHandler();

	friend void DMA2_Stream5_IRQHandler();
	friend void DMA1_Stream5_IRQHandler();
	friend void DMA1_Stream1_IRQHandler();

	UART_IDX idx;
	int hwFlowCtrl;
	int baudrate;
	HAL_UART* hal_uart;
	int uartRxError;


	USART_TypeDef *UARTx;

	GPIO_PIN tx;
	GPIO_PIN rx;
	GPIO_PIN rts;
	GPIO_PIN cts;

	bool isDMAEnabeld;
	volatile bool DMATransmitRunning;
	volatile int DMATransmitRunningSize;
	volatile bool DMAReceiveRunning;
	volatile int DMAReceiveRunningSize;

	int DMAMaxReceiveSize;

	BlockFifo<uint8_t,UART_BUF_SIZE> receiveBuffer;
	BlockFifo<uint8_t,UART_BUF_SIZE> transmittBuffer;

	void DMATransmitFinishedHandler();
	void DMAReceiveFinishedHandler();


	void DMAConfigure();
	void DMAStartTransfer(void* memoryBuffer,int len);
	void DMAStartReceive(void* memoryBuffer,int len);


	void SendTxBufWithDMA();
	void RceiveIntoRxBufWithDMA();

	void UARTIRQHandler();

	int init(unsigned int baudrate);
	void initMembers(HAL_UART* halUart, UART_IDX uartIdx, GPIO_PIN txPin, GPIO_PIN rxPin, GPIO_PIN rtsPin, GPIO_PIN ctsPin);

	uint32_t getRCC_APBxPeriph_UARTx();
	uint8_t getGPIO_AF_UARTx();
	IRQn getUARTx_IRQn();
	USART_TypeDef* getUARTx();
};


HW_HAL_UART UART_contextArray[UART_IDX_MAX+1];
DMA_Stream_TypeDef*  UART_DMA_TxStreams[3] = {DMA2_Stream7,DMA1_Stream6,DMA1_Stream3};
DMA_Stream_TypeDef*  UART_DMA_RxStreams[3] = {DMA2_Stream5,DMA1_Stream5,DMA1_Stream1};

/*
volatile bool enableDMATriggerThread=false;
void ReceiveTrigger::run()
{

	while(!enableDMATriggerThread){
		suspendCallerUntil(NOW()+ 10 * SECONDS);
	}

    TIME_LOOP(1*MILLISECONDS, DMA_TIMEOUT) {
    	for(int i=1;i<=3;i++){
    		if(UART_contextArray[i].isDMAEnabeld){
    			DMA_Cmd(UART_DMA_RxStreams[i-1],DISABLE);
    		}
    	}
    }

}

sttic ReceiveTrigger triggerthread;
*/

HAL_UART::HAL_UART(UART_IDX uartIdx, GPIO_PIN txPin, GPIO_PIN rxPin, GPIO_PIN rtsPin, GPIO_PIN ctsPin) {

    if ((uartIdx < UART_IDX_MIN) || (uartIdx > UART_IDX_MAX)) {
        context = &UART_contextArray[UART_IDX0]; // UART_IDX0 is not used in this implementation
                                                 // -> so we can use this contextArray to save wrong idx
                                                 // -> with this saved idx all HAL_UART-methods will return correctly with -1
        context->idx = uartIdx;
        return;
    }

	context = &UART_contextArray[uartIdx];
	context->initMembers(this, uartIdx, txPin, rxPin, rtsPin, ctsPin);
}


HAL_UART::HAL_UART(UART_IDX uartIdx){

    if ((uartIdx < UART_IDX_MIN) || (uartIdx > UART_IDX_MAX)) {
        context = &UART_contextArray[UART_IDX0]; // UART_IDX0 is not used in this implementation
                                                 // -> so we can use this contextArray to save wrong idx
                                                 // -> with this saved idx all HAL_UART-methods will return correctly with -1
        context->idx = uartIdx;
        return;
    }

	context = &UART_contextArray[uartIdx];

	switch (uartIdx){
	case UART_IDX1: //                tx-PB6    rx-PB7    rts-PA12  cts-PA11
	    context->initMembers(this, uartIdx, GPIO_022, GPIO_023, GPIO_012, GPIO_011);
	    break;

    case UART_IDX2: //                tx-PD5    rx-PD6    rts-PD4   cts- PD3
        context->initMembers(this, uartIdx, GPIO_053, GPIO_054, GPIO_052, GPIO_051);
        break;

