sabil62/Floatsat/codes/obc/dependencies/rodos/support/support-programs/middleware-standalone/src/stm32f4/hal/hal_uart.cpp
    case UART_IDX3: //                tx-PD8    rx-PD9    rts-PB14  cts-PD11
        context->initMembers(this, uartIdx, GPIO_056, GPIO_057, GPIO_030, GPIO_059);
        break;

    case UART_IDX4: //                tx-PC10   rx-PC11
        context->initMembers(this, uartIdx, GPIO_042, GPIO_043, GPIO_INVALID, GPIO_INVALID);
        break;

    case UART_IDX5: //                tx-PC12   rx-PD2
        context->initMembers(this, uartIdx, GPIO_044, GPIO_050, GPIO_INVALID, GPIO_INVALID);
        break;

    case UART_IDX6: //                tx-PC6    rx-PC7    rts-PG8   cts-PG15
        context->initMembers(this, uartIdx, GPIO_038, GPIO_039, GPIO_104, GPIO_111);
        break;

    case UART_IDX7: //                tx-PF7    rx-PF6
        context->initMembers(this, uartIdx, GPIO_087, GPIO_086, GPIO_INVALID, GPIO_INVALID);
        break;

    case UART_IDX8: //                tx-PE1    rx-PE0
        context->initMembers(this, uartIdx, GPIO_065, GPIO_064, GPIO_INVALID, GPIO_INVALID);
        break;

    default: break;
	}
};




extern "C"
{

void USART1_IRQHandler() {
	UART_contextArray[UART_IDX1].UARTIRQHandler();
	NVIC_ClearPendingIRQ(USART1_IRQn);
}


void USART2_IRQHandler() {
	UART_contextArray[UART_IDX2].UARTIRQHandler();
	NVIC_ClearPendingIRQ(USART2_IRQn);
}

void USART3_IRQHandler() {
	UART_contextArray[UART_IDX3].UARTIRQHandler();
	NVIC_ClearPendingIRQ(USART3_IRQn);
}


void UART4_IRQHandler() {
	UART_contextArray[UART_IDX4].UARTIRQHandler();
	NVIC_ClearPendingIRQ(UART4_IRQn);
}


void UART5_IRQHandler() {
	UART_contextArray[UART_IDX5].UARTIRQHandler();
	NVIC_ClearPendingIRQ(UART5_IRQn);
}

void USART6_IRQHandler() {
    UART_contextArray[UART_IDX6].UARTIRQHandler();
    NVIC_ClearPendingIRQ(USART6_IRQn);
}

#if defined (STM32F427_437xx) || defined (STM32F429_439xx)
void UART7_IRQHandler() {
    UART_contextArray[UART_IDX7].UARTIRQHandler();
    NVIC_ClearPendingIRQ(UART7_IRQn);
}

void UART8_IRQHandler() {
    UART_contextArray[UART_IDX8].UARTIRQHandler();
    NVIC_ClearPendingIRQ(UART8_IRQn);
}
#endif



//DMA tx for UART1
void DMA2_Stream7_IRQHandler(){
	if(DMA_GetITStatus(DMA2_Stream7,DMA_IT_TCIF7))
	{
		DMA_ClearITPendingBit(DMA2_Stream7,DMA_IT_TCIF7);
		NVIC_ClearPendingIRQ(DMA2_Stream7_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX1].DMATransmitFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA2_Stream7_IRQn);
	}
}

//DMA tx for UART2
void DMA1_Stream6_IRQHandler(){
	if(DMA_GetITStatus(DMA1_Stream6,DMA_IT_TCIF6))
	{
		DMA_ClearITPendingBit(DMA1_Stream6,DMA_IT_TCIF6);
		NVIC_ClearPendingIRQ(DMA1_Stream6_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX2].DMATransmitFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA1_Stream6_IRQn);
	}

}

//DMA tx for UART3
void DMA1_Stream3_IRQHandler(){
	if(DMA_GetITStatus(DMA1_Stream3,DMA_IT_TCIF3))
	{
		DMA_ClearITPendingBit(DMA1_Stream3,DMA_IT_TCIF3);
		NVIC_ClearPendingIRQ(DMA1_Stream3_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX3].DMATransmitFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA1_Stream3_IRQn);
	}

}

//DMA rx for UART1
void DMA2_Stream5_IRQHandler(){
	if(DMA_GetITStatus(DMA2_Stream5,DMA_IT_TCIF5))
	{
		DMA_ClearITPendingBit(DMA2_Stream5,DMA_IT_TCIF5);
		NVIC_ClearPendingIRQ(DMA2_Stream5_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX1].DMAReceiveFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA2_Stream5_IRQn);
	}
}

//DMA rx for UART2
void DMA1_Stream5_IRQHandler(){
	if(DMA_GetITStatus(DMA1_Stream5,DMA_IT_TCIF5))
	{
		DMA_ClearITPendingBit(DMA1_Stream5,DMA_IT_TCIF5);
		NVIC_ClearPendingIRQ(DMA1_Stream5_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX2].DMAReceiveFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA1_Stream5_IRQn);
	}

}

//DMA rx for UART3
void DMA1_Stream1_IRQHandler(){
	if(DMA_GetITStatus(DMA1_Stream1,DMA_IT_TCIF1))
	{
		DMA_ClearITPendingBit(DMA1_Stream1,DMA_IT_TCIF1);
		NVIC_ClearPendingIRQ(DMA1_Stream1_IRQn); // Clear this before calling the next function because this may start a new DMA TRansfer, which can already generate a new Interrupt
		UART_contextArray[UART_IDX3].DMAReceiveFinishedHandler();
	}else{
		NVIC_ClearPendingIRQ(DMA1_Stream1_IRQn);
	}

}


} // end extern "C"


/*
 * USART
 * - all USART will be initialized in 8N1 mode
 */
int HAL_UART::init(unsigned int iBaudrate) {

	if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}

	return context->init(iBaudrate);
}


int HAL_UART::config(UART_PARAMETER_TYPE type, int paramVal) {

	UART_IDX idx = context->idx;

	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX)) {return -1;}

	USART_TypeDef* usart = context->UARTx;
	USART_InitTypeDef Uis;
	GPIO_InitTypeDef gpioRTS;
	GPIO_InitTypeDef gpioCTS;

	USART_StructInit(&Uis);
	Uis.USART_BaudRate = context->baudrate;
	Uis.USART_HardwareFlowControl = context->hwFlowCtrl;

	switch (type) {
		case UART_PARAMETER_BAUDRATE:
			if (paramVal > 0)
			{
				Uis.USART_BaudRate = paramVal;
				context->baudrate = paramVal;
			}
			else {return -1;}
			break;

		case UART_PARAMETER_HW_FLOW_CONTROL:
		    // HW flow control is only supported by USART1/2/3/6
			if (idx == UART_IDX4 || idx == UART_IDX5 || idx == UART_IDX7 || idx == UART_IDX8) {return -1;}

			GPIO_StructInit(&gpioRTS);
			GPIO_StructInit(&gpioCTS);

			/* if rts and cts are set to GPIO_INVALID HW flow control is not available */
			if (paramVal > 0 && context->rts != GPIO_INVALID){ // enable HW Flow Control
				Uis.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
				context->hwFlowCtrl = USART_HardwareFlowControl_RTS_CTS;
				HW_HAL_GPIO::configureAFPin(context->rts, context->getGPIO_AF_UARTx());
				HW_HAL_GPIO::configureAFPin(context->cts, context->getGPIO_AF_UARTx());
			} else if(context->rts != GPIO_INVALID){  // disable HW Flow Control
				Uis.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
				context->hwFlowCtrl = USART_HardwareFlowControl_None;
				HW_HAL_GPIO::resetPin(context->rts);
				HW_HAL_GPIO::resetPin(context->cts);
			}
			break;  // end case UART_PARAMETER_HW_FLOW_CONTROL

		case UART_PARAMETER_ENABLE_DMA:
		    if(context->idx > UART_IDX_MAX_DMA){ //Only UART 1-3 support DMA
		        return -1;
		    }
		    context->DMAConfigure();
		    if(paramVal > UART_BUF_SIZE){
		        context->DMAMaxReceiveSize=UART_BUF_SIZE;
		    }else{
		        context->DMAMaxReceiveSize=paramVal;
		    }
		    context->isDMAEnabeld=true;
		    context->RceiveIntoRxBufWithDMA();
		    //enableDMATriggerThread=true;
		    return 0;

