sabil62/Floatsat/codes/obc/dependencies/rodos/support/support-programs/middleware-standalone/src/stm32f4/hal/hal_uart.cpp
		default: return -1;
	}

	USART_Cmd(usart, DISABLE);
	USART_Init(usart, &Uis);
	USART_Cmd(usart, ENABLE);

	return 0;
	
}


void HAL_UART::reset(){
	if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return;}

	USART_TypeDef *usart = context->UARTx;

	// Interrupt UART disable
	NVIC_DisableIRQ(context->getUARTx_IRQn());

	// reset interface
	USART_DeInit(usart);

	HW_HAL_GPIO::resetPin(context->rx);
	HW_HAL_GPIO::resetPin(context->tx);
	if (context->rts != GPIO_INVALID) HW_HAL_GPIO::resetPin(context->rts);
	if (context->cts != GPIO_INVALID) HW_HAL_GPIO::resetPin(context->cts);
}


int HAL_UART::read(char* buf, int size) {

    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}
    if(size <=0) return 0;

    int readCnt = 0;
    int i = 0;

    uint8_t* p = context->receiveBuffer.getBufferToRead(readCnt);

    if (p) {
        if (readCnt > size) {readCnt = size;}

        for (i = 0; i < readCnt; i++ ) {
            buf[i] = p[i];
        }
        context->receiveBuffer.readConcluded(readCnt);

        if(context->isDMAEnabeld && !context->DMAReceiveRunning){
            context->RceiveIntoRxBufWithDMA();
        }

        return readCnt;
    } else {
        return 0;
    }
}


int HAL_UART::write(const char* buf, int size) {

    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}
    if(size <=0) return 0;

    int i = 0;

    int spaceinbuffer;

    uint8_t* p = context->transmittBuffer.getBufferToWrite(spaceinbuffer);

    if(p){
        if(spaceinbuffer < size){
            size=spaceinbuffer;
        }

        for (i=0;i<size;i++){
            p[i]=buf[i];
        }
        context->transmittBuffer.writeConcluded(size);

        USART_ITConfig(context->UARTx,USART_IT_TC,DISABLE);
        if(context->isDMAEnabeld){
            if(!context->DMATransmitRunning){
                context->SendTxBufWithDMA();
            }
        }else{
            USART_ITConfig(context->UARTx,USART_IT_TXE,ENABLE);
        }


        return size;
    }else{
        return 0;
    }
}


int HAL_UART::getcharNoWait() {
    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}

	uint8_t c = 0;
	bool dataAvailible = context->receiveBuffer.get(c);

	if(context->isDMAEnabeld && !context->DMAReceiveRunning){
		context->RceiveIntoRxBufWithDMA();
	}

	if (dataAvailible)
	{
		return (int)c;
	}else	{
		return -1;
	}
}


int HAL_UART::putcharNoWait(char c) {
    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}

	if(context->transmittBuffer.put(c)){

		 USART_ITConfig(context->UARTx,USART_IT_TC,DISABLE);
		if(context->isDMAEnabeld){
			if(!context->DMATransmitRunning){
				context->SendTxBufWithDMA();
			}
		}else{
			USART_ITConfig(context->UARTx,USART_IT_TXE,ENABLE);
		}
		return c & 0xFF;
	}else{
		return -1;
	}

}


int HAL_UART::status(UART_STATUS_TYPE type) {
    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return -1;}

	switch (type)
	{
		case UART_STATUS_RX_BUF_LEVEL:
			return context->receiveBuffer.getElementCount();

		case UART_STATUS_RX_ERROR:
			int temp;
			temp=context->uartRxError;
			context->uartRxError=0;
			return temp;

//		case UART_STATUS_TX_COMPLETE:
//		    return (USART_GetFlagStatus(context->UARTx,USART_FLAG_TC) == SET);

		//...
		default: return -1;
	}
}


bool HAL_UART::isWriteFinished() {
    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return false;}
	return context->transmittBuffer.isEmpty() && (USART_GetFlagStatus(context->UARTx,USART_FLAG_TC) == SET);
}


bool HAL_UART::isDataReady() {
    if ((context->idx < UART_IDX_MIN) || (context->idx > UART_IDX_MAX)) {return false;}
	return !context->receiveBuffer.isEmpty();
}










/****************** HW_HAL_UART *******************/

void HW_HAL_UART::initMembers(HAL_UART* halUart, UART_IDX uartIdx, GPIO_PIN txPin, GPIO_PIN rxPin, GPIO_PIN rtsPin, GPIO_PIN ctsPin){
     idx = uartIdx;
     baudrate = 115200;
     hwFlowCtrl = UART_PARAMETER_HW_FLOW_CONTROL;
     hal_uart = halUart;
     isDMAEnabeld = false;
     DMATransmitRunning = false;
     DMAReceiveRunning = false;
     UARTx = getUARTx();
     tx = txPin;
     rx = rxPin;
     rts = rtsPin;
     cts = ctsPin;
}


void HW_HAL_UART::DMAConfigure() {
	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX_DMA)) {return;}

	EnableDMAClock();

	DMA_InitTypeDef DMA_InitStruct;

//Configure tx DMA

      DMA_Stream_TypeDef* dma=UART_DMA_TxStreams[idx-1];

	  DMA_StructInit(&DMA_InitStruct);
	  DMA_InitStruct.DMA_Channel = DMA_Channel_4; //All UARTS have Channel 4
	  DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(UARTx->DR);
	  DMA_InitStruct.DMA_Memory0BaseAddr = (uint32_t)0; //Changed later
	  DMA_InitStruct.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	  DMA_InitStruct.DMA_BufferSize = 16; //Changed later
	  DMA_InitStruct.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	  DMA_InitStruct.DMA_MemoryInc = DMA_MemoryInc_Enable;
	  DMA_InitStruct.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	  DMA_InitStruct.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	  DMA_InitStruct.DMA_Mode = DMA_Mode_Normal;
	  DMA_InitStruct.DMA_Priority = DMA_Priority_Medium;
	  DMA_InitStruct.DMA_FIFOMode = DMA_FIFOMode_Disable;
	  DMA_InitStruct.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
	  DMA_InitStruct.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	  DMA_InitStruct.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	  DMA_Init(dma, &DMA_InitStruct);

	  DMA_ITConfig(dma,DMA_IT_TC,ENABLE);

	  USART_DMACmd(UARTx,USART_DMAReq_Tx,ENABLE);

	  //Configure Rx DMA

	  dma=UART_DMA_RxStreams[idx-1];

	  DMA_StructInit(&DMA_InitStruct);
	  DMA_InitStruct.DMA_Channel = DMA_Channel_4; //All UARTS have Channel 4
	  DMA_InitStruct.DMA_PeripheralBaseAddr = (uint32_t)&(UARTx->DR);
	  DMA_InitStruct.DMA_Memory0BaseAddr = (uint32_t)0; //Changed later
	  DMA_InitStruct.DMA_DIR = DMA_DIR_PeripheralToMemory;
	  DMA_InitStruct.DMA_BufferSize = 16; //Changed later
	  DMA_InitStruct.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	  DMA_InitStruct.DMA_MemoryInc = DMA_MemoryInc_Enable;
	  DMA_InitStruct.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	  DMA_InitStruct.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	  DMA_InitStruct.DMA_Mode = DMA_Mode_Normal;
	  DMA_InitStruct.DMA_Priority = DMA_Priority_Medium;
	  DMA_InitStruct.DMA_FIFOMode = DMA_FIFOMode_Disable;
	  DMA_InitStruct.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
	  DMA_InitStruct.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	  DMA_InitStruct.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	  DMA_Init(dma, &DMA_InitStruct);

	  DMA_ITConfig(dma,DMA_IT_TC,ENABLE);

