sabil62/Floatsat/codes/obc/dependencies/rodos/support/support-programs/middleware-standalone/src/stm32f4/hal/hal_uart.cpp
	  USART_ITConfig(UARTx,USART_IT_RXNE,DISABLE);
	  USART_ITConfig(UARTx,USART_IT_ERR,ENABLE);
	  USART_DMACmd(UARTx,USART_DMAReq_Rx,ENABLE);

	  //Enable DMA IRQs
	  switch(idx){
	  case UART_IDX1:
	      NVIC_EnableIRQ(DMA2_Stream7_IRQn);
	      NVIC_EnableIRQ(DMA2_Stream5_IRQn);
	      break;
	  case UART_IDX2:
	      NVIC_EnableIRQ(DMA1_Stream6_IRQn);
	      NVIC_EnableIRQ(DMA1_Stream5_IRQn);
	      break;
	  case UART_IDX3:
	      NVIC_EnableIRQ(DMA1_Stream3_IRQn);
	      NVIC_EnableIRQ(DMA1_Stream1_IRQn);
	      break;
	  default:
	      break;
	  }


}

void HW_HAL_UART::DMAStartTransfer(void* memoryBuffer,int len) {

	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX_DMA)) {return;}

	DMA_Stream_TypeDef* dma=UART_DMA_TxStreams[idx-1];

	DMA_Cmd(dma,DISABLE);

	//USART_ClearFlag(uart_getRegPointer(idx),USART_FLAG_TC);

	dma->M0AR=(uint32_t)memoryBuffer;
	dma->NDTR= len;

	//PRINTF("Start with UART %d DMA @ %d len=%d",idx,(int)memoryBuffer,len);

	DMA_Cmd(dma,ENABLE);

}

void HW_HAL_UART::DMAStartReceive(void* memoryBuffer,int len) {

	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX_DMA)) {return;}

	DMA_Stream_TypeDef* dma=UART_DMA_RxStreams[idx-1];

	DMA_Cmd(dma,DISABLE);
	while(DMA_GetCmdStatus(dma)==ENABLE){}


	dma->M0AR=(uint32_t)memoryBuffer;
	dma->NDTR= len;


	DMA_Cmd(dma,ENABLE);


	//USART_ClearFlag(uart_getRegPointer(idx),USART_FLAG_ORE);
	//USART_DMACmd(uart_getRegPointer(idx),USART_DMAReq_Rx,ENABLE);
}

void HW_HAL_UART::DMATransmitFinishedHandler(){
	//PRINTF("enter general dma irq handler ");

	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX_DMA)) {return;}

	//while(USART_GetFlagStatus(uart_getRegPointer(idx),USART_FLAG_TC)==SET){}

	DMA_Stream_TypeDef* dma=UART_DMA_TxStreams[idx-1];
	int bytesNotTransfered = DMA_GetCurrDataCounter(dma); //Should be zero
	int bytesTransfered = DMATransmitRunningSize-bytesNotTransfered;

	transmittBuffer.readConcluded(bytesTransfered);

	if(transmittBuffer.isEmpty()){ //Buffer now emtpy
		DMATransmitRunning=false;
		//hal_uart->upCallWriteFinished();
		 USART_ITConfig(UARTx,USART_IT_TC,ENABLE);
	}else{
		SendTxBufWithDMA();
	}

}

void HW_HAL_UART::DMAReceiveFinishedHandler() {

	if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX_DMA)) {return;}

	//while(USART_GetFlagStatus(uart_getRegPointer(idx),USART_FLAG_TC)==SET){}

	DMA_Stream_TypeDef* dma=UART_DMA_RxStreams[idx-1];
	int bytesTransfered = DMAReceiveRunningSize-DMA_GetCurrDataCounter(dma);

	receiveBuffer.writeConcluded(bytesTransfered);

	if(bytesTransfered > 0){
		hal_uart->upCallDataReady();
	}

	RceiveIntoRxBufWithDMA();

}


void HW_HAL_UART::SendTxBufWithDMA() {

	int len;
	uint8_t*  p = transmittBuffer.getBufferToRead(len);

	if(p){
		DMATransmitRunningSize=len;
		DMATransmitRunning=true;
		DMAStartTransfer(p,len);
	}
}

void HW_HAL_UART::RceiveIntoRxBufWithDMA() {

	int len;
	uint8_t* p;

	p = receiveBuffer.getBufferToWrite(len);

	if(p){

		if(len > DMAMaxReceiveSize) len = DMAMaxReceiveSize;

		DMAReceiveRunningSize=len;
		DMAReceiveRunning=true;
		DMAStartReceive(p,len);
	}else{
		DMAReceiveRunning=false; //Buffer Overflow, disable Receive until next read
		uartRxError++;
	}

}


void EnableDMAClock() {

	static bool init=false;
	if(!init){
		init=true;
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
	}
}


void HW_HAL_UART::UARTIRQHandler() {

    uint8_t c;

    if (USART_GetFlagStatus(UARTx,USART_FLAG_ORE) || (isDMAEnabeld && USART_GetITStatus(UARTx,USART_IT_ERR)))
    {
        USART_ReceiveData(UARTx);
        uartRxError++;
    }

    else if (USART_GetITStatus(UARTx,USART_IT_RXNE))
    {
        c = USART_ReceiveData(UARTx) & 0xFF;
        if(!receiveBuffer.put(c)){
            uartRxError++; //FIFO OVerflow
        }

        hal_uart->upCallDataReady();

    }else if(USART_GetITStatus(UARTx,USART_IT_TXE)){
        if(transmittBuffer.get(c)){
            UARTx->DR=c;
        }else{
            // no more data, disable TXE
            USART_ITConfig(UARTx,USART_IT_TXE,DISABLE);
            USART_ITConfig(UARTx,USART_IT_TC,ENABLE);
            //hal_uart->upCallWriteFinished();
        }
    }else if(USART_GetITStatus(UARTx,USART_IT_TC)){
        USART_ITConfig(UARTx,USART_IT_TC,DISABLE);
        hal_uart->upCallWriteFinished();
    }

}


uint32_t HW_HAL_UART::getRCC_APBxPeriph_UARTx() {

    switch(idx){
    case UART_IDX1: return RCC_APB2Periph_USART1;
    case UART_IDX2: return RCC_APB1Periph_USART2;
    case UART_IDX3: return RCC_APB1Periph_USART3;
    case UART_IDX4: return RCC_APB1Periph_UART4;
    case UART_IDX5: return RCC_APB1Periph_UART5;
    case UART_IDX6: return RCC_APB2Periph_USART6;
    case UART_IDX7: return RCC_APB1Periph_UART7;
    case UART_IDX8: return RCC_APB1Periph_UART8;
    default: return 0;
    }
}


uint8_t HW_HAL_UART::getGPIO_AF_UARTx() {

    switch(idx){
    case UART_IDX1: return GPIO_AF_USART1;
    case UART_IDX2: return GPIO_AF_USART2;
    case UART_IDX3: return GPIO_AF_USART3;
    case UART_IDX4: return GPIO_AF_UART4;
    case UART_IDX5: return GPIO_AF_UART5;
    case UART_IDX6: return GPIO_AF_USART6;
    case UART_IDX7: return GPIO_AF_UART7;
    case UART_IDX8: return GPIO_AF_UART8;
    default: return 0;
    }
}


IRQn HW_HAL_UART::getUARTx_IRQn() {

    switch(idx){
    case UART_IDX1: return USART1_IRQn;
    case UART_IDX2: return USART2_IRQn;
    case UART_IDX3: return USART3_IRQn;
    case UART_IDX4: return UART4_IRQn;
    case UART_IDX5: return UART5_IRQn;
    case UART_IDX6: return USART6_IRQn;
#if defined (STM32F427_437xx) || defined (STM32F429_439xx)
    case UART_IDX7: return UART7_IRQn;
    case UART_IDX8: return UART8_IRQn;
#endif
    default: return USART1_IRQn;
    }
}

USART_TypeDef* HW_HAL_UART::getUARTx() {

    switch(idx){
    case UART_IDX1: return USART1;
    case UART_IDX2: return USART2;
    case UART_IDX3: return USART3;
    case UART_IDX4: return UART4;
    case UART_IDX5: return UART5;
    case UART_IDX6: return USART6;
    case UART_IDX7: return UART7;
    case UART_IDX8: return UART8;
    default: return NULL;
    }
    return NULL;
}

int HW_HAL_UART::init(unsigned int baudrate) {

    if ((idx < UART_IDX_MIN) || (idx > UART_IDX_MAX)) {return -1;}

    this->baudrate = baudrate;

    USART_InitTypeDef Uis;

    // Release reset and enable clock
    USART_DeInit(UARTx); // reset

    if (idx == UART_IDX1 || idx == UART_IDX6){
        RCC_APB2PeriphClockCmd(getRCC_APBxPeriph_UARTx(), ENABLE); // only USART1/6 are connected to APB2
    //    RCC_AHB2PeriphResetCmd(UART_CLK, DISABLE); // it's done in USART_DeInit()
    }else{
        RCC_APB1PeriphClockCmd(getRCC_APBxPeriph_UARTx(), ENABLE); // USART2/3 & UART4/5/7/8 are connected to APB1
    //    RCC_AHB1PeriphResetCmd(UART_CLK, DISABLE); // it's done in USART_DeInit()
    }

    HW_HAL_GPIO::configureAFPin(rx,getGPIO_AF_UARTx());
    HW_HAL_GPIO::configureAFPin(tx,getGPIO_AF_UARTx());
    // !!! do not init RTS & CTS -> HW flow control is disabled per default !!!
    //if (rts != GPIO_INVALID) configurePin(rts);
    //if (cts != GPIO_INVALID) configurePin(cts);

    USART_StructInit(&Uis);         // init struct to 8N1
    Uis.USART_BaudRate = baudrate;  // set baudrate
    USART_Init(UARTx, &Uis);        // init USART/UART
    USART_Cmd(UARTx, ENABLE);       // enable USART/UART

    // Interrupt USART enable
    USART_ITConfig(UARTx,USART_IT_RXNE,ENABLE);
    USART_ITConfig(UARTx,USART_IT_TXE,ENABLE);
    NVIC_EnableIRQ(getUARTx_IRQn());

    return 0;
}

#ifndef NO_RODOS_NAMESPACE
}
#endif

